Testing/load-test/test.yml
config:
  target: "https://dilli-vibe-6zrg.onrender.com/api"

phases:
  - duration: 60
    arrivalRate: 10

scenarios:
  - flow:

      # 🔐 LOGIN
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "12345678"
          capture:
            - json: "$.data.token"
              as: "authToken"

      # 🧪 DEBUG (optional)
      - log: "TOKEN = {{ authToken }}"

      # 📊 API CALL
      - get:
          url: "/api/recommendations?page=1&limit=6"
          headers:
            Authorization: "Bearer {{ authToken }}"